saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32L0xx_DFP.2.0.0.pdsc
          <control if="jep106id != 0x20">
            <block>
              Query(0, "Not a genuine ST Device! Abort connection", 1);
              Message(2, "Not a genuine ST Device! Abort connection.");
            </block>
          </control>
        </sequence>
      </sequences>

      <feature type="Other"         n="1"                           name="20-byte backup register"/>
      <feature type="RNG"           n="1"                           name="True Random Number Generator"/>
      <feature type="Other"         n="1"/>
      <feature type="MemoryOther"   n="1"                           name="2048 Bytes EEPROM"/>
      <feature type="DMA"           n="7"/>
      <feature type="Timer"         n="5"       m="16"/>
      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="USART"         n="3"       m="4000000"/>
      <feature type="I2C"           n="2"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="VCC"           n="1.65"    m="3.60"/>

      <!-- ************************  Subfamily 'STM32L011'  **************************** -->
      <subFamily DsubFamily="STM32L011">
        <processor Dclock="32000000" Dmpu="NO_MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L011xx"/>
        <debug svd="CMSIS/SVD/STM32L0x1.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L01_2x_EEPROM.FLM" start="0x08080000" size="0x00000200" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documentation/DM00206508.pdf" title="STM32L011xx Data Sheet"/>

        <!-- *************************  Device 'STM32L011D3'  ***************************** -->
        <device Dname="STM32L011D3">
          <memory id="IROM1"                              start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011D3Px"> <feature type="SOP" n="14"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011D4'  ***************************** -->
        <device Dname="STM32L011D4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011D4Px"> <feature type="SOP" n="14"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011E3'  ***************************** -->
        <!--device Dname="STM32L011E3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011E3Yx"> <feature type="CSP" n="25"/> </variant>
        </device-->

        <!-- *************************  Device 'STM32L011E4'  ***************************** -->
        <device Dname="STM32L011E4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011E4Yx"> <feature type="CSP" n="25"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011F3'  ***************************** -->
        <device Dname="STM32L011F3">
          <memory id="IROM1"                              start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011F3Px"> <feature type="SOP" n="20"/> </variant>
          <variant Dvariant="STM32L011F3Ux"> <feature type="QFN" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011F4'  ***************************** -->
        <device Dname="STM32L011F4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011F4Px"> <feature type="SOP" n="20"/> </variant>
          <variant Dvariant="STM32L011F4Ux"> <feature type="QFN" n="20"/> </variant>
        </device>

