saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32L0xx_DFP.2.0.0.pdsc
          <variant Dvariant="STM32L021K4Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L021K4Ux"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L031'  **************************** -->
      <subFamily DsubFamily="STM32L031">
        <processor Dclock="32000000" Dmpu="NO_MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L031xx"/>
        <debug svd="CMSIS/SVD/STM32L0x1.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L03_4x_EEPROM.FLM" start="0x08080000" size="0x00000400" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documentation/DM00140359.pdf" title="STM32L031xx Data Sheet"/>

        <!-- *************************  Device 'STM32L031C4'  ***************************** -->
        <device Dname="STM32L031C4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L031C4Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031C6'  ***************************** -->
        <device Dname="STM32L031C6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031C6Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031E4'  ***************************** -->
        <device Dname="STM32L031E4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L031E4Yx"> <feature type="CSP" n="25"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031E6'  ***************************** -->
        <device Dname="STM32L031E6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031E6Yx"> <feature type="CSP" n="25"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031F4'  ***************************** -->
        <device Dname="STM32L031F4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L031F4Px"> <feature type="SOP" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031F6'  ***************************** -->
        <device Dname="STM32L031F6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031F6Px"> <feature type="SOP" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031G4'  ***************************** -->
        <device Dname="STM32L031G4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L031G4Ux"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031G6'  ***************************** -->
        <device Dname="STM32L031G6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <variant Dvariant="STM32L031G6Ux"> <feature type="QFN" n="28"/> </variant>
          <variant Dvariant="STM32L031G6UxS"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L031K4'  ***************************** -->
        <device Dname="STM32L031K4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

