saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32L0xx_DFP.2.0.0.pdsc
        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documentation/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

        <feature type="SPI"           n="2"       m="16000000"/>

        <!-- *************************  Device 'STM32L051C6'  ***************************** -->
        <device Dname="STM32L051C6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

          <variant Dvariant="STM32L051C6Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L051C8'  ***************************** -->
        <device Dname="STM32L051C8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

          <variant Dvariant="STM32L051C8Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L051K6'  ***************************** -->
        <device Dname="STM32L051K6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="27"/>

          <variant Dvariant="STM32L051K6Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L051K6Ux"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L051K8'  ***************************** -->
        <device Dname="STM32L051K8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="27"/>

          <variant Dvariant="STM32L051K8Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L051K8Ux"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L051R6'  ***************************** -->
        <device Dname="STM32L051R6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

          <variant Dvariant="STM32L051R6Hx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L051R6Tx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L051R8'  ***************************** -->
        <device Dname="STM32L051R8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

          <variant Dvariant="STM32L051R8Hx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L051R8Tx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L051T6'  ***************************** -->
        <device Dname="STM32L051T6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

          <variant Dvariant="STM32L051T6Yx"> <feature type="CSP" n="36"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L051T8'  ***************************** -->
        <device Dname="STM32L051T8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

          <variant Dvariant="STM32L051T8Yx"> <feature type="CSP" n="36"/> </variant>
        </device>
      </subFamily>

