saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32L0xx_DFP.2.0.0.pdsc
      <component Cgroup="STM32Cube LL" Csub="LPTIM" Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Low Power Timer (LPTIM) interface LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_LPTIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_lptim.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="LPUART" Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Universal asynchronous receiver transmitter (LPUART) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_LPUART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_lpuart.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="PWR" Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Power controller (PWR) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_PWR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_pwr.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="RCC"    Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Reset and clock control (RCC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_RCC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_rcc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="RNG"    Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Random Number Generator (RNG) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_RNG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_rng.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="RTC" Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Real-time clock (RTC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_RTC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_rtc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="SPI" Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Serial peripheral interface (SPI) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_SPI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_spi.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="TIM" Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Timers (TIM) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_TIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_tim.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="USART" Cversion="1.8.2"  condition="STM32L0 LL">
        <description>Universal synchronous asynchronous receiver transmitter (USART) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_USART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_usart.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="UTILS"  Cversion="1.8.2"  condition="STM32L0 LL">
        <description>UTILS LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_UTILS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_utils.c"/>
        </files>
      </component>        
    </bundle>   

    <!-- CMSIS drivers -->
     <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.1"  Cversion="1.0.0" condition="STM32L0 CMSIS STM32CubeMX">
      <description>I2C Driver for STM32L0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/I2C_STM32L0xx.c"/>
    </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.1"  Cversion="1.0.0" condition="STM32L0 CMSIS STM32CubeMX">
      <description>SPI Driver for STM32L0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32L0xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART IrDA" Capiversion="2.1"  Cversion="1.0.0" condition="STM32L0 CMSIS STM32CubeMX">
      <description>USART Driver (IrDA mode) for STM32L0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_IrDA         /* Driver USART1 */
        #define RTE_Drivers_USART2_IrDA         /* Driver USART2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/IrDA_STM32L0xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART SmartCard" Capiversion="2.1"  Cversion="1.0.0" condition="STM32L0 CMSIS STM32CubeMX">
      <description>USART Driver (SmartCard mode) for STM32L0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_SmartCard    /* Driver USART1 */
        #define RTE_Drivers_USART2_SmartCard    /* Driver USART2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32L0xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART Async" Capiversion="2.1"  Cversion="1.0.0" condition="STM32L0 CMSIS STM32CubeMX">
      <description>USART Driver (Async mode) for STM32L0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_Async        /* Driver USART1 */
        #define RTE_Drivers_USART2_Async        /* Driver USART2 */
        #define RTE_Drivers_USART4_Async        /* Driver USART4 */
        #define RTE_Drivers_USART5_Async        /* Driver USART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/UART_STM32L0xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART Sync" Capiversion="2.1"  Cversion="1.0.0" condition="STM32L0 CMSIS STM32CubeMX">
      <description>USART Driver (Sync mode) for STM32L0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_Sync         /* Driver USART1 */
        #define RTE_Drivers_USART2_Sync         /* Driver USART2 */
        #define RTE_Drivers_USART4_Sync         /* Driver USART4 */
        #define RTE_Drivers_USART5_Sync         /* Driver USART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USART_STM32L0xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1.0" Cversion="1.0.0" condition="STM32L0 CMSIS STM32CubeMX">
      <description>USB Device Driver for STM32L0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USBD_STM32L0xx.c"/>
      </files>
    </component>

