saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32L0xx_DFP.2.0.0.pdsc
    <!-- STM32L053-Discovery Board Support -->
    <bundle Cbundle="STM32L053-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32L053-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32L053 CMSIS STM32CubeMX">
      <description>LED driver for STMicroelectronics STM32L053-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L053-Discovery/Common/LED_STM32L053-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32L053 CMSIS STM32CubeMX">
      <description>Button driver for STMicroelectronics STM32L053-Discovery Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32L053-Discovery/Common/Buttons_STM32L053-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32L073Z-EVAL Board Support -->
    <bundle Cbundle="STM32L073Z-EVAL" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32L073Z-EVAL Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32L073 CMSIS STM32CubeMX">
      <description>LED driver for STMicroelectronics STM32L073Z-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L073Z-EVAL/Common/LED_STM32L073Z-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32L073 CMSIS STM32CubeMX">
      <description>Button driver for STMicroelectronics STM32L073Z-EVAL Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32L073Z-EVAL/Common/Buttons_STM32L073Z-EVAL.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <!-- STM32L053-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32L053-Discovery" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Discovery kit with STM32L053C8T6 MCU</description>
      <image small="MDK/Boards/ST/STM32L053-Discovery/Documents/STM32L053-Discovery_small.jpg"
             large="MDK/Boards/ST/STM32L053-Discovery/Documents/STM32L053-Discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1848/PF260319" title="STM32L053-Discovery Web Page"/>
      <book category="other"     name="MDK/Boards/ST/STM32L053-Discovery/Documents/DM00122138.pdf" title="Data Brief"/>
      <book category="manual"    name="MDK/Boards/ST/STM32L053-Discovery/Documents/DM00118944.pdf" title="User Manual"/>
      <book category="schematic" name="MDK/Boards/ST/STM32L053-Discovery/Documents/MB1143.pdf"     title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L053C8"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L053"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="USB"       n="1"              name="User USB with Mini-B connector"/>
      <feature type="Button"    n="2"              name="User, Reset"/>
      <feature type="GLCD"      n="1"  m="172.72"  name="2.04” E-paper display, 172x72 pixels"/>
      <feature type="Touch"     n="1"              name="Linear Touch Sensor or four Touch Keys"/>
      <feature type="LED"       n="4"              name="USB COM, 3.3 V Power, 2 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- STM32L073Z-EVAL Board Support -->
    <board vendor="STMicroelectronics" name="STM32L073Z-EVAL" revision="Rev.A"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Evaluation Board with STM32L073VZ MCU</description>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L073VZ"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L073"/>
    </board>
  </boards>

  <examples>
    <!-- STM32L053-Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L053-Discovery/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32L053-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTOS2</category>
      </attributes>
    </example>

    <!-- STM32L073Z-EVAL Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L073Z-EVAL/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32L073Z-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTOS2</category>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L073Z-EVAL/Middleware/USB/Device/HID" version="1.0.0">
      <description>USB Human Interface Device providing access from PC to board LEDs and push buttons</description>
      <board name="STM32L073Z-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L073Z-EVAL/Middleware/USB/Device/MassStorage">
      <description>USB Mass Storage Device using RAM as storage media</description>
      <board name="STM32L073Z-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>
  </examples>

</package>
